In [1]:
import csv
import pandas as pd
import datetime as dt

In [4]:
path = "SanFransciso_calendar.csv"

In [5]:
df1 = pd.read_csv(path)

In [6]:
df1.head()

   listing_id        date available price
0         958  2019-12-05         f   NaN
1         958  2019-12-04         f   NaN
2         958  2019-12-03         f   NaN
3         958  2019-12-02         f   NaN
4         958  2019-12-01         f   NaN

In [7]:
df1 = df1.sort_values(by="date",ascending= True)

In [8]:
df1.head()

         listing_id        date available    price
2581279    30087255  2018-12-06         t   $43.00
2101141    25728058  2018-12-06         f      NaN
1973191    24471190  2018-12-06         t  $212.00
1539608    20279527  2018-12-06         f      NaN
95630        479072  2018-12-06         f      NaN

In [9]:
df1.dtypes

listing_id     int64
date          object
available     object
price         object
dtype: object

In [10]:
df2 = df1
timefmt = "%Y-%m-%d" 
df2['date'] = pd.to_datetime(df2['date'], format = timefmt, errors='coerce')

In [11]:
df2.head()

         listing_id       date available    price
2581279    30087255 2018-12-06         t   $43.00
2101141    25728058 2018-12-06         f      NaN
1973191    24471190 2018-12-06         t  $212.00
1539608    20279527 2018-12-06         f      NaN
95630        479072 2018-12-06         f      NaN

In [12]:
today_dt = dt.date.today()
today = dt.datetime.strftime(today_dt, '%Y-%m-%d')

#extract year, month, and day as integers
todayYear = int(dt.datetime.strftime(today_dt, '%Y'))
todayMonth = int(dt.datetime.strftime(today_dt, '%m'))
todayDay = int(dt.datetime.strftime(today_dt, '%d'))


week_later_dt = dt.date(todayYear, todayMonth, todayDay) + dt.timedelta(days=8)
week_later = dt.datetime.strftime(week_later_dt, '%Y-%m-%d')
week_later

'2018-12-29'

In [13]:
df2 = df2.loc[(df2['date']>=today) & (df2['date']<week_later) & (df2['available']=='t'),:]
df2.head()

         listing_id       date available    price
2054218    24968111 2018-12-21         t   $78.00
2235134    27316423 2018-12-21         t   $92.00
25815         70753 2018-12-21         t   $48.00
59612         38607 2018-12-21         t  $109.00
1605620    21120542 2018-12-21         t  $350.00

In [14]:
df2['price'].value_counts().head()
df2.dtypes

listing_id             int64
date          datetime64[ns]
available             object
price                 object
dtype: object

In [15]:
df2["new_price"] = df2["price"].str.strip('$')

C:\Users\karth\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [16]:
df2["new_price"] = pd.to_numeric(df2["new_price"],errors='coerce')

C:\Users\karth\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [17]:
df2.dtypes

listing_id             int64
date          datetime64[ns]
available             object
price                 object
new_price            float64
dtype: object

In [18]:

bins = [0, 50, 100, 150, 200, 250]

# Create the names for the four bins
group_names = ["Under $50", "$50-100", "$100-150", "$150-200", "$200-250"]

df2["price"] = pd.cut(df2["new_price"], bins, labels=group_names)

C:\Users\karth\Anaconda3\lib\site-packages\ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  import sys

In [19]:
# today_dt
under_50 = []
fifty_100 = []
hundred_150 = []
onefifty_200 = []
twohundred_250 = []

numdays = 8
date_list = [today_dt + dt.timedelta(days=x) for x in range(0, numdays)]

date_list = [dt.datetime.strftime(i, '%Y-%m-%d') for i in date_list]
date_list

for i in date_list:
    prices = df2.loc[df2["date"] == i, "price"].value_counts()
    under_50.append(prices[0])
    fifty_100.append(prices[1])
    hundred_150.append(prices[2])
    onefifty_200.append(prices[3])
    twohundred_250.append(prices[4])

In [20]:
df3 = pd.DataFrame({"Date": date_list, 
                     "Under $50": under_50, 
                     "$50-100": fifty_100, 
                     "$100-150": hundred_150,
                     "$150-200": onefifty_200,
                     "$200-250": twohundred_250
                    })
df3
SFO_airbnb = df3
# df3.set_index("Date")

In [21]:
SFO_airbnb

         Date  Under $50  $50-100  $100-150  $150-200  $200-250
0  2018-12-21        177      799       798       470       248
1  2018-12-22        178      778       751       466       243
2  2018-12-23        192      792       751       457       255
3  2018-12-24        182      774       721       450       241
4  2018-12-25        188      763       724       463       241
5  2018-12-26        191      779       755       477       235
6  2018-12-27        195      774       761       493       244
7  2018-12-28        191      720       744       466       244